---
kind: other
id: Properties.T:Autodesk.Revit.DB.IntegerParameterValue
source: html/01bb79ed-d675-9b45-6a29-e9be5bd52973.htm
---
# IntegerParameterValue Properties

Specifies whether the .NET object represents a valid Revit entity.